runs/run/fio/hpchub-4-nodes-vSC/hpchub-2-nodes-vSC-torque-n001/2018-03-05_22:38:14/out.log
rm: невозможно удалить «job*»: Нет такого файла или каталога
cat machinefile
n002.vcluster slots=20
n001.vcluster slots=20
getbw.value: 4929
getlat.value: 809.8
log-128m-randread-job.n001: 
box.n001: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.n001: Laying out IO file (1 file / 128MiB)

box.n001: (groupid=0, jobs=1): err= 0: pid=26139: Mon Mar  5 22:38:47 2018
   read: IOPS=1200, BW=4801KiB/s (4916kB/s)(128MiB/27303msec)
    clat (usec): min=418, max=21407, avg=830.62, stdev=257.33
     lat (usec): min=418, max=21407, avg=830.90, stdev=257.33
    clat percentiles (usec):
     |  1.00th=[  537],  5.00th=[  611], 10.00th=[  660], 20.00th=[  717],
     | 30.00th=[  758], 40.00th=[  783], 50.00th=[  816], 60.00th=[  840],
     | 70.00th=[  873], 80.00th=[  914], 90.00th=[  996], 95.00th=[ 1074],
     | 99.00th=[ 1303], 99.50th=[ 1467], 99.90th=[ 3097], 99.95th=[ 5276],
     | 99.99th=[ 7701]
   bw (  KiB/s): min= 4064, max= 5448, per=100.00%, avg=4807.96, stdev=253.66, samples=54
   iops        : min= 1016, max= 1362, avg=1201.65, stdev=63.46, samples=54
  lat (usec)   : 500=0.38%, 750=27.78%, 1000=62.48%
  lat (msec)   : 2=9.17%, 4=0.13%, 10=0.07%, 20=0.01%, 50=0.01%
  cpu          : usr=0.51%, sys=2.32%, ctx=32855, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4801KiB/s (4916kB/s), 4801KiB/s-4801KiB/s (4916kB/s-4916kB/s), io=128MiB (134MB), run=27303-27303msec

Disk stats (read/write):
  sda: ios=32675/316, merge=0/234, ticks=26542/10842, in_queue=37368, util=97.03%
log-128m-randread-job.n002: 
box.n002: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.n002: Laying out IO file (1 file / 128MiB)

box.n002: (groupid=0, jobs=1): err= 0: pid=22570: Mon Mar  5 22:38:49 2018
   read: IOPS=1264, BW=5057KiB/s (5179kB/s)(128MiB/25918msec)
    clat (usec): min=432, max=8808, avg=788.44, stdev=150.71
     lat (usec): min=432, max=8808, avg=788.70, stdev=150.71
    clat percentiles (usec):
     |  1.00th=[  515],  5.00th=[  586], 10.00th=[  635], 20.00th=[  701],
     | 30.00th=[  734], 40.00th=[  758], 50.00th=[  783], 60.00th=[  807],
     | 70.00th=[  840], 80.00th=[  873], 90.00th=[  930], 95.00th=[  996],
     | 99.00th=[ 1156], 99.50th=[ 1254], 99.90th=[ 1713], 99.95th=[ 2442],
     | 99.99th=[ 4752]
   bw (  KiB/s): min= 4432, max= 5320, per=99.59%, avg=5036.12, stdev=214.75, samples=51
   iops        : min= 1108, max= 1330, avg=1259.02, stdev=53.68, samples=51
  lat (usec)   : 500=0.61%, 750=36.75%, 1000=58.21%
  lat (msec)   : 2=4.35%, 4=0.05%, 10=0.02%
  cpu          : usr=0.42%, sys=2.46%, ctx=32859, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5057KiB/s (5179kB/s), 5057KiB/s-5057KiB/s (5179kB/s-5179kB/s), io=128MiB (134MB), run=25918-25918msec

Disk stats (read/write):
  sda: ios=32708/1, merge=0/0, ticks=25293/3, in_queue=25282, util=97.32%
cat machinefile
n002.vcluster slots=20
n001.vcluster slots=20
rm: невозможно удалить «job*»: Нет такого файла или каталога
getbw.value: 674.5
getlat.value: 4439.5
log-128m-randwrite-job.n001: 
box.n001: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n001: (groupid=0, jobs=1): err= 0: pid=26619: Mon Mar  5 22:39:00 2018
  write: IOPS=179k, BW=699MiB/s (733MB/s)(128MiB/183msec)
    clat (nsec): min=3624, max=29601, avg=4093.10, stdev=947.01
     lat (nsec): min=3795, max=29780, avg=4274.27, stdev=960.79
    clat percentiles (nsec):
     |  1.00th=[ 3696],  5.00th=[ 3728], 10.00th=[ 3760], 20.00th=[ 3792],
     | 30.00th=[ 3792], 40.00th=[ 3824], 50.00th=[ 3856], 60.00th=[ 3856],
     | 70.00th=[ 3888], 80.00th=[ 3984], 90.00th=[ 4704], 95.00th=[ 5792],
     | 99.00th=[ 7776], 99.50th=[10432], 99.90th=[13632], 99.95th=[18816],
     | 99.99th=[21376]
  lat (usec)   : 4=82.09%, 10=17.37%, 20=0.52%, 50=0.02%
  cpu          : usr=20.88%, sys=79.12%, ctx=19, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=699MiB/s (733MB/s), 699MiB/s-699MiB/s (733MB/s-733MB/s), io=128MiB (134MB), run=183-183msec

Disk stats (read/write):
  sda: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
log-128m-randwrite-job.n002: 
box.n002: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n002: (groupid=0, jobs=1): err= 0: pid=23107: Mon Mar  5 22:39:01 2018
  write: IOPS=166k, BW=650MiB/s (681MB/s)(128MiB/197msec)
    clat (nsec): min=3887, max=28721, avg=4426.15, stdev=983.76
     lat (nsec): min=4056, max=29741, avg=4604.73, stdev=1010.62
    clat percentiles (nsec):
     |  1.00th=[ 3984],  5.00th=[ 4048], 10.00th=[ 4048], 20.00th=[ 4080],
     | 30.00th=[ 4128], 40.00th=[ 4128], 50.00th=[ 4192], 60.00th=[ 4192],
     | 70.00th=[ 4256], 80.00th=[ 4320], 90.00th=[ 4896], 95.00th=[ 6112],
     | 99.00th=[ 8896], 99.50th=[11968], 99.90th=[14144], 99.95th=[15936],
     | 99.99th=[20608]
  lat (usec)   : 4=1.66%, 10=97.55%, 20=0.77%, 50=0.02%
  cpu          : usr=13.78%, sys=85.71%, ctx=21, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=650MiB/s (681MB/s), 650MiB/s-650MiB/s (681MB/s-681MB/s), io=128MiB (134MB), run=197-197msec

Disk stats (read/write):
  sda: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
cat machinefile
n002.vcluster slots=20
n001.vcluster slots=20
rm: невозможно удалить «job*»: Нет такого файла или каталога
getbw.value: 168
getlat.value: 15359.925
log-128m-read-job.n001: 
box.n001: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n001: (groupid=0, jobs=1): err= 0: pid=26784: Mon Mar  5 22:39:12 2018
   read: IOPS=44.5k, BW=174MiB/s (182MB/s)(128MiB/736msec)
    clat (nsec): min=472, max=7138.1k, avg=15066.99, stdev=155699.36
     lat (nsec): min=585, max=7138.2k, avg=15185.77, stdev=155699.22
    clat percentiles (nsec):
     |  1.00th=[    498],  5.00th=[    524], 10.00th=[    532],
     | 20.00th=[    548], 30.00th=[    564], 40.00th=[    572],
     | 50.00th=[    596], 60.00th=[    692], 70.00th=[    780],
     | 80.00th=[    812], 90.00th=[    852], 95.00th=[    908],
     | 99.00th=[ 634880], 99.50th=[1204224], 99.90th=[1990656],
     | 99.95th=[2244608], 99.99th=[5210112]
   bw (  KiB/s): min=96152, max=96152, per=53.99%, avg=96152.00, stdev= 0.00, samples=1
   iops        : min=24038, max=24038, avg=24038.00, stdev= 0.00, samples=1
  lat (nsec)   : 500=1.14%, 750=63.08%, 1000=32.81%
  lat (usec)   : 2=1.58%, 4=0.07%, 10=0.09%, 20=0.05%, 50=0.05%
  lat (usec)   : 100=0.01%, 250=0.03%, 500=0.03%, 750=0.11%, 1000=0.19%
  lat (msec)   : 2=0.66%, 4=0.08%, 10=0.01%
  cpu          : usr=2.31%, sys=9.80%, ctx=388, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=174MiB/s (182MB/s), 174MiB/s-174MiB/s (182MB/s-182MB/s), io=128MiB (134MB), run=736-736msec

Disk stats (read/write):
  sda: ios=225/322, merge=0/0, ticks=598/43215, in_queue=43817, util=83.66%
log-128m-read-job.n002: 
box.n002: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n002: (groupid=0, jobs=1): err= 0: pid=23339: Mon Mar  5 22:39:13 2018
   read: IOPS=41.4k, BW=162MiB/s (170MB/s)(128MiB/791msec)
    clat (nsec): min=454, max=20626k, avg=15416.90, stdev=184650.09
     lat (nsec): min=567, max=20626k, avg=15534.08, stdev=184650.12
    clat percentiles (nsec):
     |  1.00th=[    470],  5.00th=[    478], 10.00th=[    482],
     | 20.00th=[    498], 30.00th=[    516], 40.00th=[    532],
     | 50.00th=[    556], 60.00th=[    620], 70.00th=[    964],
     | 80.00th=[   1012], 90.00th=[   1080], 95.00th=[   1160],
     | 99.00th=[ 724992], 99.50th=[1204224], 99.90th=[1875968],
     | 99.95th=[2179072], 99.99th=[3948544]
   bw (  KiB/s): min=100760, max=100760, per=60.81%, avg=100760.00, stdev= 0.00, samples=1
   iops        : min=25190, max=25190, avg=25190.00, stdev= 0.00, samples=1
  lat (nsec)   : 500=22.41%, 750=39.80%, 1000=14.32%
  lat (usec)   : 2=22.05%, 4=0.03%, 10=0.15%, 20=0.07%, 50=0.05%
  lat (usec)   : 100=0.01%, 250=0.02%, 500=0.04%, 750=0.08%, 1000=0.22%
  lat (msec)   : 2=0.68%, 4=0.07%, 10=0.01%, 50=0.01%
  cpu          : usr=1.77%, sys=9.99%, ctx=390, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=162MiB/s (170MB/s), 162MiB/s-162MiB/s (170MB/s-170MB/s), io=128MiB (134MB), run=791-791msec

Disk stats (read/write):
  sda: ios=294/322, merge=0/0, ticks=789/42108, in_queue=42895, util=86.13%
cat machinefile
n002.vcluster slots=20
n001.vcluster slots=20
rm: невозможно удалить «job*»: Нет такого файла или каталога
getbw.value: 679.5
Illegal division by zero at -e line 1, <> line 56.
getlat.value: 
log-128m-write-job.n001: 
box.n001: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n001: (groupid=0, jobs=1): err= 0: pid=26952: Mon Mar  5 22:39:23 2018
  write: IOPS=170k, BW=663MiB/s (695MB/s)(128MiB/193msec)
    clat (usec): min=3, max=8490, avg= 4.45, stdev=65.82
     lat (usec): min=3, max=8491, avg= 4.62, stdev=65.82
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    6],
     | 99.00th=[    7], 99.50th=[   11], 99.90th=[   15], 99.95th=[   21],
     | 99.99th=[  145]
  lat (usec)   : 4=85.44%, 10=14.01%, 20=0.50%, 50=0.04%, 100=0.01%
  lat (usec)   : 250=0.01%
  lat (msec)   : 10=0.01%
  cpu          : usr=14.58%, sys=76.04%, ctx=20, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=663MiB/s (695MB/s), 663MiB/s-663MiB/s (695MB/s-695MB/s), io=128MiB (134MB), run=193-193msec

Disk stats (read/write):
  sda: ios=0/2, merge=0/0, ticks=0/7, in_queue=7, util=4.32%
log-128m-write-job.n002: 
box.n002: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n002: (groupid=0, jobs=1): err= 0: pid=23572: Mon Mar  5 22:39:24 2018
  write: IOPS=178k, BW=696MiB/s (729MB/s)(128MiB/184msec)
    clat (usec): min=3, max=151, avg= 4.17, stdev= 1.22
     lat (usec): min=3, max=151, avg= 4.34, stdev= 1.23
    clat percentiles (nsec):
     |  1.00th=[ 3792],  5.00th=[ 3824], 10.00th=[ 3856], 20.00th=[ 3888],
     | 30.00th=[ 3920], 40.00th=[ 3920], 50.00th=[ 3952], 60.00th=[ 3984],
     | 70.00th=[ 4016], 80.00th=[ 4080], 90.00th=[ 4640], 95.00th=[ 5280],
     | 99.00th=[ 7200], 99.50th=[10816], 99.90th=[13888], 99.95th=[18816],
     | 99.99th=[23936]
  lat (usec)   : 4=67.94%, 10=31.54%, 20=0.49%, 50=0.03%, 250=0.01%
  cpu          : usr=19.13%, sys=80.33%, ctx=19, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=696MiB/s (729MB/s), 696MiB/s-696MiB/s (729MB/s-729MB/s), io=128MiB (134MB), run=184-184msec

Disk stats (read/write):
  sda: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
cat machinefile
n002.vcluster slots=20
n001.vcluster slots=20
rm: невозможно удалить «job*»: Нет такого файла или каталога
getbw.value: 3458.5
getlat.value: 12452.84
log-1024m-randread-job.n001: 
box.n001: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.n001: Laying out IO file (1 file / 1024MiB)
fio: ENOSPC on laying out file, stopping

box.n001: (groupid=0, jobs=1): err= 0: pid=27260: Mon Mar  5 22:42:36 2018
   read: IOPS=1690, BW=6762KiB/s (6924kB/s)(1024MiB/155078msec)
    clat (nsec): min=1998, max=17167k, avg=589395.07, stdev=412567.21
     lat (usec): min=2, max=17166, avg=589.63, stdev=412.57
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[  578], 40.00th=[  717], 50.00th=[  766], 60.00th=[  799],
     | 70.00th=[  832], 80.00th=[  865], 90.00th=[  922], 95.00th=[  971],
     | 99.00th=[ 1172], 99.50th=[ 1369], 99.90th=[ 3294], 99.95th=[ 4490],
     | 99.99th=[ 7439]
   bw (  KiB/s): min= 6120, max= 7568, per=99.83%, avg=6749.54, stdev=235.92, samples=310
   iops        : min= 1530, max= 1892, avg=1687.37, stdev=58.99, samples=310
  lat (usec)   : 2=0.01%, 4=7.92%, 10=20.31%, 20=0.27%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.15%, 750=18.03%, 1000=49.69%
  lat (msec)   : 2=3.44%, 4=0.11%, 10=0.07%, 20=0.01%
  cpu          : usr=0.52%, sys=2.49%, ctx=187914, majf=0, minf=197
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6762KiB/s (6924kB/s), 6762KiB/s-6762KiB/s (6924kB/s-6924kB/s), io=1024MiB (1074MB), run=155078-155078msec

Disk stats (read/write):
  sda: ios=187165/9, merge=0/0, ticks=150886/48, in_queue=150855, util=97.32%
log-1024m-randread-job.n002: 
box.n002: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.n002: Laying out IO file (1 file / 1024MiB)
fio: ENOSPC on laying out file, stopping

box.n002: (groupid=0, jobs=1): err= 0: pid=23947: Mon Mar  5 22:40:06 2018
   read: IOPS=39.7k, BW=155MiB/s (162MB/s)(1024MiB/6610msec)
    clat (nsec): min=1828, max=201375k, avg=24159.02, stdev=425518.99
     lat (nsec): min=1978, max=201376k, avg=24316.05, stdev=425519.10
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[  824], 99.50th=[  906], 99.90th=[ 1237], 99.95th=[ 1663],
     | 99.99th=[ 4555]
   bw (  KiB/s): min=67368, max=177768, per=96.88%, avg=153681.23, stdev=32195.01, samples=13
   iops        : min=16842, max=44442, avg=38420.31, stdev=8048.75, samples=13
  lat (usec)   : 2=0.01%, 4=91.69%, 10=5.51%, 20=0.40%, 50=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.80%, 1000=1.32%
  lat (msec)   : 2=0.22%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 250=0.01%
  cpu          : usr=3.57%, sys=13.09%, ctx=6381, majf=0, minf=57
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=155MiB/s (162MB/s), 155MiB/s-155MiB/s (162MB/s-162MB/s), io=1024MiB (1074MB), run=6610-6610msec

Disk stats (read/write):
  sda: ios=6090/4, merge=0/0, ticks=5303/13, in_queue=5315, util=81.25%
rm: невозможно удалить «job*»: Нет такого файла или каталога
cat machinefile
n002.vcluster slots=20
n001.vcluster slots=20
fio: io_u error on file box.n001.0.0: No space left on device: write offset=794877952, buflen=4096
fio: io_u error on file box.n002.0.0: No space left on device: write offset=64757760, buflen=4096
box.n002: No I/O performed by psync, perhaps try --debug=io option for details?
getbw.value: 29.9
getlat.value: 41722
log-1024m-randwrite-job.n001: 
box.n001: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n001: (groupid=0, jobs=1): err=28 (file:io_u.c:1833, func=io_u error, error=No space left on device): pid=28248: Mon Mar  5 22:42:47 2018
  write: IOPS=14, BW=29.9KiB/s (30.6kB/s)(4096B/134msec)
    clat (nsec): min=40293, max=40293, avg=40293.00, stdev= 0.00
     lat (nsec): min=41722, max=41722, avg=41722.00, stdev= 0.00
    clat percentiles (nsec):
     |  1.00th=[40192],  5.00th=[40192], 10.00th=[40192], 20.00th=[40192],
     | 30.00th=[40192], 40.00th=[40192], 50.00th=[40192], 60.00th=[40192],
     | 70.00th=[40192], 80.00th=[40192], 90.00th=[40192], 95.00th=[40192],
     | 99.00th=[40192], 99.50th=[40192], 99.90th=[40192], 99.95th=[40192],
     | 99.99th=[40192]
  lat (usec)   : 50=50.00%
  cpu          : usr=0.00%, sys=76.69%, ctx=16, majf=0, minf=69
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=33.3%, 4=66.7%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=29.9KiB/s (30.6kB/s), 29.9KiB/s-29.9KiB/s (30.6kB/s-30.6kB/s), io=4096B (4096B), run=134-134msec

Disk stats (read/write):
  sda: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
log-1024m-randwrite-job.n002: 
box.n002: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n002: (groupid=0, jobs=1): err=28 (file:io_u.c:1833, func=io_u error, error=No space left on device): pid=25000: Mon Mar  5 22:42:48 2018
  cpu          : usr=0.00%, sys=41.07%, ctx=59, majf=0, minf=65
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=50.0%, 4=50.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):

Disk stats (read/write):
  sda: ios=108/4, merge=0/0, ticks=164/21, in_queue=185, util=23.60%
rm: невозможно удалить «job*»: Нет такого файла или каталога
cat machinefile
n002.vcluster slots=20
n001.vcluster slots=20
getbw.value: 731
getlat.value: 11596.96
log-1024m-read-job.n001: 
box.n001: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n001: (groupid=0, jobs=1): err= 0: pid=28400: Mon Mar  5 22:43:03 2018
   read: IOPS=47.4k, BW=185MiB/s (194MB/s)(1024MiB/5534msec)
    clat (nsec): min=454, max=1159.1M, avg=20484.79, stdev=2389596.30
     lat (nsec): min=565, max=1159.1M, avg=20602.99, stdev=2389596.30
    clat percentiles (nsec):
     |  1.00th=[    466],  5.00th=[    474], 10.00th=[    478],
     | 20.00th=[    486], 30.00th=[    972], 40.00th=[   1032],
     | 50.00th=[   1048], 60.00th=[   1064], 70.00th=[   1080],
     | 80.00th=[   1096], 90.00th=[   1112], 95.00th=[   1144],
     | 99.00th=[ 659456], 99.50th=[1105920], 99.90th=[1679360],
     | 99.95th=[1925120], 99.99th=[2375680]
   bw (  KiB/s): min= 1536, max=629248, per=100.00%, avg=199216.00, stdev=166307.20, samples=10
   iops        : min=  384, max=157312, avg=49804.00, stdev=41576.80, samples=10
  lat (nsec)   : 500=23.35%, 750=4.53%, 1000=5.39%
  lat (usec)   : 2=64.58%, 4=0.02%, 10=0.17%, 20=0.03%, 50=0.07%
  lat (usec)   : 100=0.47%, 250=0.12%, 500=0.15%, 750=0.20%, 1000=0.29%
  lat (msec)   : 2=0.59%, 4=0.04%, 10=0.01%, 500=0.01%, 2000=0.01%
  cpu          : usr=1.88%, sys=9.85%, ctx=3787, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=185MiB/s (194MB/s), 185MiB/s-185MiB/s (194MB/s-194MB/s), io=1024MiB (1074MB), run=5534-5534msec

Disk stats (read/write):
  sda: ios=4257/1, merge=0/0, ticks=13025/6, in_queue=13028, util=95.21%
log-1024m-read-job.n002: 
box.n002: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n002: (groupid=0, jobs=1): err= 0: pid=25216: Mon Mar  5 22:43:00 2018
   read: IOPS=327k, BW=1277MiB/s (1339MB/s)(1024MiB/802msec)
    clat (nsec): min=459, max=2616.5k, avg=2474.17, stdev=27354.27
     lat (nsec): min=572, max=2616.6k, avg=2590.93, stdev=27355.19
    clat percentiles (nsec):
     |  1.00th=[    470],  5.00th=[    474], 10.00th=[    478],
     | 20.00th=[    478], 30.00th=[    482], 40.00th=[    482],
     | 50.00th=[    486], 60.00th=[    490], 70.00th=[    498],
     | 80.00th=[    510], 90.00th=[    524], 95.00th=[    700],
     | 99.00th=[  87552], 99.50th=[  89600], 99.90th=[ 111104],
     | 99.95th=[ 342016], 99.99th=[1417216]
   bw (  MiB/s): min= 1097, max= 1097, per=85.99%, avg=1097.97, stdev= 0.00, samples=1
   iops        : min=281080, max=281080, avg=281080.00, stdev= 0.00, samples=1
  lat (nsec)   : 500=73.50%, 750=21.96%, 1000=0.45%
  lat (usec)   : 2=2.34%, 4=0.01%, 10=0.11%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=1.52%, 250=0.05%, 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=13.48%, sys=67.54%, ctx=342, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1277MiB/s (1339MB/s), 1277MiB/s-1277MiB/s (1339MB/s-1339MB/s), io=1024MiB (1074MB), run=802-802msec

Disk stats (read/write):
  sda: ios=399/0, merge=0/0, ticks=1312/0, in_queue=1312, util=22.30%
rm: невозможно удалить «job*»: Нет такого файла или каталога
cat machinefile
n002.vcluster slots=20
n001.vcluster slots=20
fio: io_u error on file box.n002.0.0: No space left on device: write offset=25669632, buflen=4096
fio: io_u error on file box.n001.0.0: No space left on device: write offset=767598592, buflen=4096
getbw.value: 387.5
getlat.value: 4527.89
log-1024m-write-job.n001: 
box.n001: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n001: (groupid=0, jobs=1): err=28 (file:io_u.c:1833, func=io_u error, error=No space left on device): pid=28581: Mon Mar  5 22:43:15 2018
  write: IOPS=163k, BW=637MiB/s (667MB/s)(732MiB/1150msec)
    clat (usec): min=3, max=11090, avg= 4.04, stdev=33.83
     lat (usec): min=3, max=11090, avg= 4.22, stdev=33.83
    clat percentiles (nsec):
     |  1.00th=[ 3568],  5.00th=[ 3600], 10.00th=[ 3632], 20.00th=[ 3664],
     | 30.00th=[ 3664], 40.00th=[ 3696], 50.00th=[ 3728], 60.00th=[ 3728],
     | 70.00th=[ 3760], 80.00th=[ 3824], 90.00th=[ 4384], 95.00th=[ 5024],
     | 99.00th=[ 6752], 99.50th=[10176], 99.90th=[13632], 99.95th=[18304],
     | 99.99th=[24704]
   bw (  KiB/s): min=667456, max=819240, per=100.00%, avg=743348.00, stdev=107327.50, samples=2
   iops        : min=166864, max=204810, avg=185837.00, stdev=26831.87, samples=2
  lat (usec)   : 4=84.85%, 10=14.64%, 20=0.48%, 50=0.03%, 100=0.01%
  lat (usec)   : 250=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%
  cpu          : usr=15.58%, sys=70.15%, ctx=159, majf=0, minf=71
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,187403,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=637MiB/s (667MB/s), 637MiB/s-637MiB/s (667MB/s-667MB/s), io=732MiB (768MB), run=1150-1150msec

Disk stats (read/write):
  sda: ios=72/8, merge=0/0, ticks=109/51, in_queue=160, util=6.35%
log-1024m-write-job.n002: 
box.n002: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.n002: (groupid=0, jobs=1): err=28 (file:io_u.c:1833, func=io_u error, error=No space left on device): pid=25503: Mon Mar  5 22:43:15 2018
  write: IOPS=35.2k, BW=138MiB/s (144MB/s)(24.5MiB/178msec)
    clat (nsec): min=3931, max=34177, avg=4356.19, stdev=1001.59
     lat (nsec): min=4095, max=35049, avg=4527.89, stdev=1007.26
    clat percentiles (nsec):
     |  1.00th=[ 3984],  5.00th=[ 4016], 10.00th=[ 4016], 20.00th=[ 4048],
     | 30.00th=[ 4080], 40.00th=[ 4128], 50.00th=[ 4128], 60.00th=[ 4192],
     | 70.00th=[ 4192], 80.00th=[ 4256], 90.00th=[ 4832], 95.00th=[ 5472],
     | 99.00th=[ 7648], 99.50th=[11200], 99.90th=[13632], 99.95th=[18304],
     | 99.99th=[34048]
  lat (usec)   : 4=3.65%, 10=95.71%, 20=0.59%, 50=0.03%
  cpu          : usr=4.52%, sys=54.80%, ctx=21, majf=0, minf=68
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,6268,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=138MiB/s (144MB/s), 138MiB/s-138MiB/s (144MB/s-144MB/s), io=24.5MiB (25.7MB), run=178-178msec

Disk stats (read/write):
  sda: ios=33/2, merge=0/0, ticks=67/12, in_queue=79, util=11.60%